# vim: filetype=ruby
# if you type "brew bundle --global", homebrew uses .Brewfile

tap "universal-ctags/universal-ctags"

brew "gnupg"
brew "tig"
brew "rg"
brew "neovim"
brew "jq"
brew "shellcheck"
brew "universal-ctags"
brew "git"
brew "fzf"
brew "ssh-copy-id"
brew "eza"
brew "fd"
brew "bat"
brew "git-delta"
brew "webp"
brew "tidy-html5"
brew "difftastic"
brew "gh"
brew "glow"
brew "mise"

# -- ansible
# brew "ansible"
# brew "ansible-lint"
# brew "yamllint"

# -- colima docker
# brew "colima"
# brew "docker"
# brew "docker-compose"
# brew "docker-buildx"

# -- other tools
# brew "maven"
# brew "mono"
# brew "pandoc"
# brew "sbt"
# brew "scala"
# brew "dotenvx/brew/dotenvx"


# -- use mise instead
# brew "bun"
# brew "nvm"
# brew "goenv"
# brew "rbenv"
# brew "ruby-build"

# -- use docker instead
# brew "mysql"
# brew "postgresql"

# -- "npm install -g jsonlint" instead
# brew "jsonlint"
