# vim: filetype=ruby
# if you type "brew bundle --global", homebrew uses .Brewfile

tap "universal-ctags/universal-ctags"
tap "oven-sh/bun"

brew "gnupg"
brew "rbenv"
brew "ruby-build"
brew "tig"
brew "rg"
brew "neovim"
brew "jq"
brew "shellcheck"
brew "jsonlint", args: ["ignore-dependencies"]
brew "universal-ctags"
brew "git"
brew "fzf"
brew "xsv"
brew "ssh-copy-id"
brew "eza"
brew "fd"
brew "bat"
brew "git-delta"
brew "webp"
brew "tidy-html5"
brew "difftastic"
brew "bun"

# brew "ag"
# brew "pandoc"
# berw "goenv"
# brew "yamllint"
# brew "vim"
# brew "mysql"
# brew "ansible"
# brew "ansible-lint"
# brew "mono"
# brew "postgresql"
# brew "direnv"
# brew "hub"
# brew "maven"
# brew "scala"
# brew "sbt"
# brew "pipenv"
# brew "nvm"
# brew "colima"
