# if you type "brew bundle --global", homebrew uses .Brewfile

tap "universal-ctags/universal-ctags"

brew "gnupg"
brew "peco"
brew "rbenv"
brew "ruby-build"
brew "tig"
brew "ag"
brew "rg"
brew "vim"
brew "jq"
brew "shellcheck"
brew "jsonlint"
brew "universal-ctags", args: ["HEAD"]
brew "git"
brew "fzf"
brew "xsv"
brew "nvm"
brew "ssh-copy-id"
brew "exa"
brew "fd"
brew "bat"
brew "git-delta"

# brew "mysql"
# brew "ansible"
# brew "mono"
# brew "postgresql"
# brew "direnv"
# brew "hub"
# brew "maven"
# brew "scala"
# brew "sbt"
# brew "direnv"
# brew "pipenv"
