# if you type "brew bundle --global", homebrew uses .Brewfile

tap "universal-ctags/universal-ctags"

brew "gnupg"
brew "nvm"
brew "peco"
brew "rbenv"
brew "ruby-build"
brew "tig"
brew "ag"
brew "rg"
brew "vim"
brew "jq"
brew "shellcheck"
brew "jsonlint"
brew "hub"
brew "universal-ctags", args: ["HEAD"]
brew "pipenv"

# brew "mysql"
# brew "ansible"
# brew "mono"
